#  Завдання 1

# Написати програму, яка обчислює значення X  в залежності від значень a та b, 
# введених користувачем з клавіатури.
# У варіантах 1-10 числа a та b можуть бути лише додатніми, 
# у варіантах 10-20 можуть приймати значення від 1 до 100. 
# Реалізувати у програмі перевірку чисел a та b, введених користувачем

a = float(input("Введіть число додатнє число a: "))
b = float(input("Введіть число додатнє число b: "))

if a <= 0 or b <= 0:
    print("Числа повинні бути додатніми!")
else:
    if a > b:
        x = a * b - 1
    elif a == b:
        x = 255
    else:  
        x = (a - 5) / b

    print("Значення X =", x)
