# Дано одномірний масив, що складається з N цілочисельних елементів. 
# Масив користувач має ввести з клавіатури. Знайти добуток всіх елементів масиву
# з непарними індексами.

N = int(input("Введіть кількість елементів масиву N: "))

array = []
print("Введіть елементи масиву(цілі числа):")
for i in range(N):
    value = int(input(f"Елемент {i}: "))
    array.append(value)

product = 1
for i in range(1, N, 2):   
    product *= array[i]

print("Добуток елементів з непарними індексами:", product)
